<template>
  <div class="container">
    <div class="card">
      <div class="item agreement">
        <span class="z-font-size-15 z-color-666 z-padding-h-10-px">{{user_agreement}}</span>
      </div>
  </div>
</div>
</template>

<script>
export default {
  data () {
    return {
      user_agreement: 'xxxx手机客户端（以下简称“xxxx”）是xxxxxxxx提供的，在使用前，请务必认真阅读和理解《xxxx许可使用协议》（以下简称《协议》）中规定的所有权利和限制。除非您接受本《协议》条款，否则您无权下载、安装或使用本“xxxx”及其相关服务。您一旦安装、复制、下载、访问或以其它方式使用xxxx产品，将视为对本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要安装、复制或使用xxxx手机客户端软件。本《协议》是用户与xxxxxxxx之间关于用户下载、安装、使用、复制的法律协议。\n' +
        '\n' +
        '一、总则\n' +
        '\n' +
        '1.1本《协议》双方为xxxxxxxx与xxxx用户，本《协议》具有合同效力。\n' +
        '\n' +
        '1.2自xxxx用户首次注册“xxxx”使用账号时起，本《协议》即在xxxxxxxx和xxxx用户之间产生法律效力。\n' +
        '\n' +
        '1.3xxxxxxxx有权修改或重新制定本《协议》，并通过xxxxxxxx网站或xxxx网站以公告形式对xxxx用户进行告知。xxxx用户在公告之日后使用“xxxx”的行为视为接受xxxxxxxx对《协议》的修改或重新制定。   \n' +
        '\n' +
        '二、知识产权声明\n' +
        '\n' +
        '2.1本“xxxx”的一切版权、商标权、专利权、商业秘密等知识产权，均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，xxxxxxxx享有上述知识产权。\n' +
        '\n' +
        '2.2未经xxxxxxxx书面同意，xxxx用户不得为任何营利性或非营利性的目的利用、转让“xxxx”使用权。\n' +
        '\n' +
        '2.3未经xxxxxxxx书面同意，xxxx用户不得自行或委托他人对“xxxx”进行反项工程、反向编译或反汇编。\n' +
        '\n' +
        '\n' +
        '\n' +
        '三、用户使用须知\n' +
        '\n' +
        '3.1xxxx由xxxxxxxx提供产品支持。\n' +
        '\n' +
        '3.2xxxx功能：xxxx手机客户端是对基于Android（安卓）系统的手机、平板电脑(PAD)等设备（以下简称手机）进行数据加密及隐私保护管理的工具，包含安全邮件的收发、浏览、管理和加密存储；安全通信录、私密短信的管理、导入、导出；安全浏览器的浏览、下载、书签管理和下载数据的加密存储；安全图片、安全视频、安全文件柜的浏览、管理、导入、导出和加密存储等功能。\n' +
        '\n' +
        '3.3 xxxx的修改和升级：xxxxxxxx保留随时为用户提供本软件的修改、升级版本的权利。由用户选择确定后，软件会进行升级更新，产生相应的数据流量费，由运营商收取。\n' +
        '\n' +
        '3.4xxxx不含有任何旨在破坏用户计算机数据和获取用户隐私信息的恶意代码，不含有任何跟踪、监视用户计算机的功能代码，不会监控用户网上、网下的行为，不会收集用户使用其它软件、文档等个人信息，不会泄漏用户隐私。\n' +
        '\n' +
        '3.5  用户应在遵守法律及本协议的\n' +
        '\n' +
        '前提下使用xxxx。用户无权实施包括但不限于下列行为：\n' +
        '\n' +
        '3.5.1不得删除或者改变xxxx上的所有权利管理电子信息；\n' +
        '\n' +
        '3.5.2不得故意避开或者破坏著作权人为保护xxxx著作权而采取的技术措施；\n' +
        '\n' +
        '3.5.3 用户不得利用xxxx误导、欺骗他人；\n' +
        '\n' +
        '3.5.4违反国家规定，对计算机信息系统功能进行删除、修改、增加、干扰，造成计算机信息系统不能正常运行；\n' +
        '\n' +
        '3.5.5未经允许，进入计算机信息网络或者使用计算机信息网络资源；\n' +
        '\n' +
        '3.5.6未经允许，对计算机信息网络功能进行删除、修改或者增加的；\n' +
        '\n' +
        '3.5.7未经允许，对计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；\n' +
        '\n' +
        '3.5.8 破坏xxxx系统或网站的正常运行，故意传播计算机病毒等破坏性程序；\n' +
        '\n' +
        '3.5.9 其他任何危害计算机信息网络安全的。\n' +
        '\n' +
        '\n' +
        '\n' +
        '四、免责与责任限制\n' +
        '\n' +
        '4.1xxxx经过详细的测试，但不能保证与所有的软硬件系统完全兼容，不能保证xxxx完全没有错误。如果出现不兼容及软件错误的情况，用户可拨打技术支持电话将情况报告xxxx客服，获得技术支持。如果无法解决兼容性问题，用户可以退订xxxx，删除xxxx客户端软件。\n' +
        '\n' +
        '4.2在适用法律允许的最大范围内，对因使用或不能使用xxxx所产生的损害及风险，包括但不限于直接或间接的个人损害、商业赢利的丧失、贸易中断、商业信息的丢失或任何其它经济损失，xxxxxxxx不承担任何责任。\n' +
        '\n' +
        '4.3对于因xxxxxxxx系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，xxxxxxxx不承担任何责任。\n' +
        '\n' +
        '五、 法律及争议解决\n' +
        '\n' +
        '5.1本协议适用中华人民共和国法律。\n' +
        '\n' +
        '5.2因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，任何一方均可将有关争议提交至xxxx仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。\n' +
        '\n' +
        '六、其他条款\n' +
        '\n' +
        '6.1如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。 \n' +
        '\n' +
        '6.2 xxxxxxxx在法律允许范围内对本协议拥有解释权与修改权。\n' +
        '\n' +
        '\n' +
        '\n' +
        'xxxxxxxx'
    }
  },
  methods: {
  }
}
</script>

<style lang='stylus' scoped>
  .container{width:100%;height:100vh;background:#e8e8e8;}
</style>
